/* Project: [PJ-0136] ChattyInfty */
/* Module : DVM_C_Display         */
/* =========================================================================    */
/* ==                         ChattyInftyOnline                           ==    */
/* ==                                                                     ==    */
/* ==                      株式会社知能情報システム                       ==    */
/* =========================================================================    */
/* -    ファイル名     ： DC_cornerTagTable.js                                  */
/* -                                                                            */
/* -    概      要     ： CornerElement(四隅の添え字要素)用 MathML タグテーブル */
/* -                                                                            */
/* -    依      存     ： DC_enum.js, utility.js                                */
/* -                                                                            */
/* -    備      考     ： 必ず DC_cornerElement.js ファイル の後に              */
/* -                      読み込んでください。                                  */
/* -                                                                            */
/* -  開  発  環  境   ： Wiondows 8.1 Pro 64bit, Firefox 35.0.1                */
/* -                                                                            */
/* -  担当 / 最終更新  ： 湯本 直杉 / 2015年03月23日                            */

CornerElement.tagTable = {
	// 数値は、mn タグです。(Math ml Number)
	'0' : 'mn', '1' : 'mn', '2' : 'mn', '3' : 'mn', '4' : 'mn',
	'5' : 'mn', '6' : 'mn', '7' : 'mn', '8' : 'mn', '9' : 'mn',
	// 演算子は、mo タグです。(Math ml Operator)
	// ------ 四則演算と最も基本的な等号
	'+' : 'mo', '-' : 'mo', '*' : 'mo', '/' : 'mo', '=' : 'mo',
	// ------ 最も基本的な括弧など
	'(' : 'mo', ')' : 'mo', '{' : 'mo', '}' : 'mo', '[' : 'mo', ']' : 'mo',
	'!' : 'mo', '?' : 'mo', '#' : 'mo', '$' : 'mo', '%' : 'mo', '&' : 'mo',
	';' : 'mo', ':' : 'mo', ',' : 'mo', '.' : 'mo', '/' : 'mo',
};


